Revit 2027 API
ElectricalSystem.CircuitNumber Property
 The CircuitNumber of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CircuitNumber { get; }
Public ReadOnly Property CircuitNumber As String
	Get
public:
property String^ CircuitNumber {
	String^ get ();
}
member CircuitNumber : string with get
Property Value
String
Remarks
 This property is used to retrieve the CircuitNumber of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace